yang377156216/MM32F032xxx/MM32F032xx/Device/HALL_LIB/Include/MM32F032xx.h
/** @addtogroup Exported_types
 * @{
 */

/*!< MM32F032xx Standard Peripheral Library old types (maintained for legacy prupose) */

typedef int32_t s32;
typedef int16_t s16;
typedef int8_t  s8;

typedef const int32_t sc32; /*!< Read Only */
typedef const int16_t sc16; /*!< Read Only */
typedef const int8_t  sc8;  /*!< Read Only */

typedef __IO int32_t vs32;
typedef __IO int16_t vs16;
typedef __IO int8_t vs8;

typedef __I int32_t vsc32; /*!< Read Only */
typedef __I int16_t vsc16; /*!< Read Only */
typedef __I int8_t vsc8;   /*!< Read Only */

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32; /*!< Read Only */
typedef const uint16_t uc16; /*!< Read Only */
typedef const uint8_t  uc8;  /*!< Read Only */

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t vu8;

typedef __I uint32_t vuc32; /*!< Read Only */
typedef __I uint16_t vuc16; /*!< Read Only */
typedef __I uint8_t vuc8;   /*!< Read Only */

typedef enum { FALSE = 0, TRUE = !FALSE } bool;

typedef enum { RESET = 0, SET = !RESET } FlagStatus, ITStatus;

typedef enum { DISABLE = 0, ENABLE = !DISABLE } FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum { ERROR = 0, SUCCESS = !ERROR } ErrorStatus;

#define SETnBIT(VALUE, BITs) ((VALUE) |= (1 << BITs))
#define RSTnBIT(VALUE, BITs) ((VALUE) &= ~(1 << BITs))

/**
 * @}
 */

/** @addtogroup Peripheral_registers_structures
 * @{
 */

/**
 * @brief Analog to Digital Converter
 */

typedef struct {
    __IO uint32_t ADDATA;     //Address offset: 0x00
    __IO uint32_t ADCFG;      //Address offset: 0x04
    __IO uint32_t ADCR;       //Address offset: 0x08
    __IO uint32_t ADCHS;      //Address offset: 0x0C
    __IO uint32_t ADCMPR;     //Address offset: 0x10
    __IO uint32_t ADSTA;      //Address offset: 0x14
    __IO uint32_t ADDR0;      //Address offset: 0x18
    __IO uint32_t ADDR1;      //Address offset: 0x1C
    __IO uint32_t ADDR2;      //Address offset: 0x20
    __IO uint32_t ADDR3;      //Address offset: 0x24
    __IO uint32_t ADDR4;      //Address offset: 0x28
    __IO uint32_t ADDR5;      //Address offset: 0x2C
    __IO uint32_t ADDR6;      //Address offset: 0x30
    __IO uint32_t ADDR7;      //Address offset: 0x34
    __IO uint32_t ADDR8;      //Address offset: 0x38
    __IO uint32_t ADDR9;      //Address offset: 0x3C
    __IO uint32_t RESERVED0;
    __IO uint32_t RESERVED1;
    __IO uint32_t RESERVED2;
    __IO uint32_t RESERVED3;
    __IO uint32_t ADDR14;      //Address offset: 0x50
    __IO uint32_t ADDR15;      //Address offset: 0x54
    __IO uint32_t ADSTA_EXT;   //Address offset: 0x58
    __IO uint32_t ADCH_ANY0;   //Address offset: 0x5C
    __IO uint32_t ADCH_ANY1;   //Address offset: 0x60
    __IO uint32_t ADANY_CFG;   //Address offset: 0x64
    __IO uint32_t ADANY_CR;    //Address offset: 0x68
} ADC_TypeDef;
/**
 * @brief Backup Registers
 */

typedef struct {
    uint32_t RESERVED0;       //Address offset: 0x00
    uint32_t RESERVED1;
    uint32_t RESERVED2;
    uint32_t RESERVED3;
    uint32_t RESERVED4;  
    uint32_t RESERVED5;
    uint32_t RESERVED6;
    uint32_t RESERVED7;
    uint32_t RESERVED8;  
    uint32_t RESERVED9;
    uint32_t RESERVED10;
    uint32_t RESERVED11;
    uint32_t RESERVED12;
    uint32_t RESERVED13;
    uint32_t RESERVED14;
    uint32_t RESERVED15;
    __IO uint32_t RTCCR;     //Address offset: 0x40
    __IO uint32_t CR;        //Address offset: 0x44
    __IO uint32_t CSR;       //Address offset: 0x48
    uint32_t      RESERVED16;
    __IO uint32_t DR1;       //Address offset: 0x50
    __IO uint32_t DR2;       //Address offset: 0x54
    __IO uint32_t DR3;       //Address offset: 0x58
    __IO uint32_t DR4;       //Address offset: 0x5C
    __IO uint32_t DR5;       //Address offset: 0x60
    __IO uint32_t DR6;       //Address offset: 0x64
    __IO uint32_t DR7;       //Address offset: 0x68
    __IO uint32_t DR8;       //Address offset: 0x6C
    __IO uint32_t DR9;       //Address offset: 0x70
    __IO uint32_t DR10;      //Address offset: 0x74

} BKP_TypeDef;
/**
 * @brief CAN basic
 */
typedef struct {
    __IO uint32_t CR;         //Address offset: 0x00
    __IO uint32_t CMR;        //Address offset: 0x04
    __IO uint32_t SR;         //Address offset: 0x08
    __IO uint32_t IR;         //Address offset: 0x0c
    __IO uint32_t ACR;        //Address offset: 0x10
    __IO uint32_t AMR;        //Address offset: 0x14
    __IO uint32_t BTR0;       //Address offset: 0x18
    __IO uint32_t BTR1;       //Address offset: 0x1C
    uint32_t      RESERVED0;  //Address offset: 0x20
    uint32_t      RESERVED1;  //Address offset: 0x24
    __IO uint32_t TXID0;      //Address offset: 0x28
    __IO uint32_t TXID1;      //Address offset: 0x2c
    __IO uint32_t TXDR0;      //Address offset: 0x30
    __IO uint32_t TXDR1;      //Address offset: 0x34
    __IO uint32_t TXDR2;      //Address offset: 0x38
    __IO uint32_t TXDR3;      //Address offset: 0x3c
    __IO uint32_t TXDR4;      //Address offset: 0x40
    __IO uint32_t TXDR5;      //Address offset: 0x44
    __IO uint32_t TXDR6;      //Address offset: 0x48
    __IO uint32_t TXDR7;      //Address offset: 0x4c
    __IO uint32_t RXID0;      //Address offset: 0x50
    __IO uint32_t RXID1;      //Address offset: 0x54
    __IO uint32_t RXDR0;      //Address offset: 0x58
    __IO uint32_t RXDR1;      //Address offset: 0x5C
    __IO uint32_t RXDR2;      //Address offset: 0x60
    __IO uint32_t RXDR3;
    __IO uint32_t RXDR4;
    __IO uint32_t RXDR5;      //Address offset: 0x6c
    __IO uint32_t RXDR6;      //Address offset: 0x70
    __IO uint32_t RXDR7;      //Address offset: 0x74
    uint32_t      RESERVED2;
    __IO uint32_t CDR;  // 0x7c
} CAN_TypeDef;

/**
 * @brief CAN Peli
 */
typedef struct {
    __IO uint32_t MOD;
    __IO uint32_t CMR;
    __IO uint32_t SR;
    __IO uint32_t IR;
    __IO uint32_t IER;        //Address offset:0x10h
    uint32_t      RESERVED0;
    __IO uint32_t BTR0;
    __IO uint32_t BTR1;
    uint32_t      RESERVED1;  //Address offset:0x20h
    uint32_t      RESERVED2;
    uint32_t      RESERVED3;
    __IO uint32_t ALC;
    __IO uint32_t ECC;       //Address offset: 0x30h
    __IO uint32_t EWLR;
    __IO uint32_t RXERR;
    __IO uint32_t TXERR;
    __IO uint32_t SFF;      //Address offset: 0x40
    __IO uint32_t ID0;
    __IO uint32_t ID1;
    __IO uint32_t DATA0;
    __IO uint32_t DATA1;    //Address offset: 0x50
    __IO uint32_t DATA2;
    __IO uint32_t DATA3;
    __IO uint32_t DATA4;
    __IO uint32_t DATA5;    //Address offset: 0x60
    __IO uint32_t DATA6;
    __IO uint32_t DATA7;
    __IO uint32_t DATA8;
    __IO uint32_t DATA9;    //Address offset: 0x70
    __IO uint32_t RMC;
    __IO uint32_t RBSA;
    __IO uint32_t CDR;
    __IO uint32_t AFM0;     //Address offset: 0x80
    __IO uint32_t AFM1;
    __IO uint32_t AFM2;
    __IO uint32_t FGA0;
    __IO uint32_t FGA1;     //Address offset: 0x90
    __IO uint32_t FGA2;
    __IO uint32_t ACR0;
    __IO uint32_t ACR1;
    __IO uint32_t ACR2;     //Address offset: 0xA0
    __IO uint32_t ACR3;
    __IO uint32_t AMR0;
    __IO uint32_t AMR1;
    __IO uint32_t AMR2;     //Address offset: 0xB0
    __IO uint32_t AMR3;
} CAN_Peli_TypeDef;

