yang377156216/MM32F032xxx/MM32F032xx/Device/HALL_LIB/Include/MM32F032xx.h
typedef struct {
    __IO uint32_t ACR0;
    __IO uint32_t ACR1;
    __IO uint32_t ACR2;
    __IO uint32_t ACR3;
    __IO uint32_t AMR0;
    __IO uint32_t AMR1;
    __IO uint32_t AMR2;
    __IO uint32_t AMR3;

} CAN_FLT_GROUP;

typedef struct {
    CAN_FLT_GROUP GROUP0;  // 0x40
    uint32_t      RESERVED[8];
    __IO uint32_t AFM0;  // 0x80
    __IO uint32_t AFM1;
    __IO uint32_t AFM2;
    __IO uint32_t FGA0;
    __IO uint32_t FGA1;  // 0x90
    __IO uint32_t FGA2;
    CAN_FLT_GROUP GROUP1;   //Address offset: 0x98
    CAN_FLT_GROUP GROUP2;   //Address offset: 0xB8
    CAN_FLT_GROUP GROUP3;   //Address offset: 0xD8
    CAN_FLT_GROUP GROUP4;   //Address offset: 0xF8
    CAN_FLT_GROUP GROUP5;   //Address offset: 0x118
    CAN_FLT_GROUP GROUP6;   //Address offset: 0x138
    CAN_FLT_GROUP GROUP7;   //Address offset: 0x158
    CAN_FLT_GROUP GROUP8;   //Address offset: 0x178
    CAN_FLT_GROUP GROUP9;   //Address offset: 0x198
    CAN_FLT_GROUP GROUP10;  //Address offset: 0x1B8
    CAN_FLT_GROUP GROUP11;  //Address offset: 0x1D8
    CAN_FLT_GROUP GROUP12;  //Address offset: 0x1F8
    CAN_FLT_GROUP GROUP13;  //Address offset: 0x218
    CAN_FLT_GROUP GROUP14;  //Address offset: 0x238
    CAN_FLT_GROUP GROUP15;  //Address offset: 0x258
    CAN_FLT_GROUP GROUP16;  //Address offset: 0x278
    CAN_FLT_GROUP GROUP17;  //Address offset: 0x298
    CAN_FLT_GROUP GROUP18;  //Address offset: 0x2B8
    CAN_FLT_GROUP GROUP19;  //Address offset: 0x2D8

} CAN_Peli_FLT_TypeDef;

/**
 * @brief CSM unit
 */

typedef struct {
    __IO uint32_t TXREG1;
    __IO uint32_t TXREG2;
    __IO uint32_t RXREG1;
    __IO uint32_t RXREG2;
    __IO uint32_t INTSTAT;
    __IO uint32_t INTEN;
    __IO uint32_t CTL1;
    __IO uint32_t CTL2;
    __IO uint32_t CFG;
    __IO uint32_t SPBRG;
    __IO uint32_t BCNT;
} CSM_TypeDef;

/**
 * @brief CRC calculation unit
 */

typedef struct {
    __IO uint32_t DR;       //Address offset: 0x00
    __IO uint32_t IDR;      //Address offset: 0x04
    __IO uint32_t CTRL;     //Address offset: 0x08
} CRC_TypeDef;


/**
 * @brief Divider
 */

typedef struct {
    __IO uint32_t DVDR;      //Address offset: 0x00
    __IO uint32_t DVSR;      //Address offset: 0x04
    __IO uint32_t QUOTR;     //Address offset: 0x08
    __IO uint32_t RMDR;      //Address offset: 0x0C
    __IO uint32_t SR;        //Address offset: 0x10
    __IO uint32_t CR;        //Address offset: 0x14
} DIVIDER_TypeDef;

/**
 * @brief Debug MCU
 */

typedef struct {
    __IO uint32_t IDCODE;   //Basic Address : 0x40013400
    __IO uint32_t CR;       //Basic Address : 0x40013404
} DBGMCU_TypeDef;

/**
 * @brief DMA Controller
 */

typedef struct {
    __IO uint32_t CCR;        //Address offset: 0x08
    __IO uint32_t CNDTR;      //Address offset: 0x0C
    __IO uint32_t CPAR;       //Address offset: 0x10
    __IO uint32_t CMAR;       //Address offset: 0x14
} DMA_Channel_TypeDef;      

typedef struct {
    __IO uint32_t ISR;      //Address offset: 0x00
    __IO uint32_t IFCR;     //Address offset: 0x04
} DMA_TypeDef;

/**
 * @brief External Interrupt/Event Controller
 */

typedef struct {
    __IO uint32_t IMR;       //Address offset: 0x00
    __IO uint32_t EMR;       //Address offset: 0x04
    __IO uint32_t RTSR;      //Address offset: 0x08
    __IO uint32_t FTSR;      //Address offset: 0x0C
    __IO uint32_t SWIER;     //Address offset: 0x10
    __IO uint32_t PR;        //Address offset: 0x14
} EXTI_TypeDef;

/**
 * @brief FLASH Registers
 */

typedef struct {
    __IO uint32_t ACR;               //Address offset: 0x00
    __IO uint32_t KEYR;              //Address offset: 0x04
    __IO uint32_t OPTKEYR;           //Address offset: 0x08
    __IO uint32_t SR;                //Address offset: 0x0C
    __IO uint32_t CR;                //Address offset: 0x10
    __IO uint32_t AR;                //Address offset: 0x14
    __IO uint32_t RESERVED;  
    __IO uint32_t OBR;               //Address offset: 0x1C
    __IO uint32_t WRP0R;             //Address offset: 0x20
    __IO uint32_t WRP1R;
    __IO uint32_t WRP2R;
    __IO uint32_t WRP3R;
    __IO uint32_t RESERVED0;
    __IO uint32_t RESERVED1;
    __IO uint32_t RESERVED2;
    __IO uint32_t RESERVED3;
    __IO uint32_t SECUKEY0R;
    __IO uint32_t SECUKEY1R;
    __IO uint32_t RESERVED4;
    __IO uint32_t RESERVED5;
    __IO uint32_t EEPKEYR;           //Address offset: 0x50
    __IO uint32_t CPU_RSTN_KEYR;     //Address offset: 0x54
    __IO uint32_t CPU_RSTN_MATCH;    //Address offset: 0x58
    __IO uint32_t SEC4_KEY;          //Address offset: 0x5C

} FLASH_TypeDef;

/**
 * @brief Option Bytes Registers
 */

typedef struct {
    __IO uint16_t RDP;
    __IO uint16_t USER;
    __IO uint16_t Data0;
    __IO uint16_t Data1;
    __IO uint16_t WRP0;
    __IO uint16_t WRP1;
    __IO uint16_t WRP2;
    __IO uint16_t WRP3;
} OB_TypeDef;

/**
 * @brief General Purpose IO
 */

typedef struct {
    __IO uint32_t CRL;       //Address offset: 0x00
    __IO uint32_t CRH;       //Address offset: 0x04
    __IO uint32_t IDR;       //Address offset: 0x08
    __IO uint32_t ODR;       //Address offset: 0x0C
    __IO uint32_t BSRR;      //Address offset: 0x10
    __IO uint32_t BRR;       //Address offset: 0x14
    __IO uint32_t LCKR;      //Address offset: 0x18
    __IO uint32_t DCR;       //Address offset: 0x1C
    __IO uint32_t AFRL;      //Address offset: 0x20
    __IO uint32_t AFRH;      //Address offset: 0x24
} GPIO_TypeDef;

/**
 * @brief SysTem Configuration
 */

typedef struct {
    __IO uint32_t CFGR;       //Address offset: 0x00
    __IO uint32_t RESERVED0;
    __IO uint32_t EXTICR[4];  //Address offset: 0x08
    __IO uint32_t PADHYS;     //Address offset: 0x18
} SYSCFG_TypeDef;

/**
 * @brief Inter-integrated Circuit Interface
 */

typedef struct {
//    __IO uint16_t I2C_CR;         //Address offset: 0x00
//    uint16_t      RESERVED0;  
//    __IO uint16_t I2C_TAR;        //Address offset: 0x04
//    uint16_t      RESERVED1;
//    __IO uint16_t I2C_SAR;        //Address offset: 0x08
//   __IO uint16_t  RESERVED2;
//    uint32_t      RESERVED3;  
//    __IO uint16_t I2C_DR;         //Address offset: 0x10
//    uint16_t      RESERVED4;
//    __IO uint16_t I2C_SSHR;       //Address offset: 0x14
//    uint16_t      RESERVED5;
//    __IO uint16_t I2C_SSLR;       //Address offset: 0x18
//    uint16_t      RESERVED6;
//    __IO uint16_t I2C_FSHR;       //Address offset: 0x1C
//    uint16_t      RESERVED7;
//    __IO uint16_t I2C_FSLR;       //Address offset: 0x20
//    uint16_t      RESERVED8;
//    uint32_t      RESERVED9;  
//    uint32_t      RESERVED10;  
//    __IO uint16_t I2C_ISR;        //Address offset: 0x2C
//    uint16_t      RESERVED11;
//    __IO uint16_t I2C_IMR;        //Address offset: 0x30
//    uint16_t      RESERVED12;
//    __IO uint16_t I2C_RAWISR;     //Address offset: 0x34
//    uint16_t      RESERVED13;
//    __IO uint16_t I2C_RXTLR;      //Address offset: 0x38
//    uint16_t      RESERVED14;
//    __IO uint16_t I2C_TXTLR;      //Address offset: 0x3C
//    uint16_t      RESERVED15;
//    __IO uint16_t I2C_ICR;        //Address offset: 0x40
//    uint16_t      RESERVED16;
//    __IO uint16_t I2C_RX_UNDER;   //Address offset: 0x44
//    uint16_t      RESERVED17;
//    __IO uint16_t I2C_RX_OVER;    //Address offset: 0x48
//    uint16_t      RESERVED18;
//    __IO uint16_t I2C_TX_OVER;    //Address offset: 0x4C
//    uint16_t      RESERVED19;
//    __IO uint16_t I2C_RD_REQ;     //Address offset: 0x50
//    uint16_t      RESERVED20;
//    __IO uint16_t I2C_TX_ABRT;    //Address offset: 0x54
//    uint16_t      RESERVED21;
//    __IO uint16_t I2C_RX_DONE;    //Address offset: 0x58
//    uint16_t      RESERVED22;
//    __IO uint16_t I2C_ACTIV;      //Address offset: 0x5C
//    uint16_t      RESERVED23;
//    __IO uint16_t I2C_STOP;       //Address offset: 0x60
//    uint16_t      RESERVED24;
//    __IO uint16_t I2C_START;      //Address offset: 0x64
//    uint16_t      RESERVED25;
//    __IO uint16_t I2C_GC;         //Address offset: 0x68
//    uint16_t      RESERVED26;
//    __IO uint16_t I2C_ENR;        //Address offset: 0x6C
//    uint16_t      RESERVED27;
//    __IO uint16_t I2C_SR;         //Address offset: 0x70
//    uint16_t      RESERVED28;
//    __IO uint16_t I2C_TXFLR;      //Address offset: 0x74
//    uint16_t      RESERVED29;
//    __IO uint16_t I2C_RXFLR;      //Address offset: 0x78
//    uint16_t      RESERVED30;
//    __IO uint32_t I2C_HOLD;       //Address offset: 0x7C
//    __IO uint32_t I2C_DMA;        //Address offset: 0x88
//    __IO uint32_t I2C_SETUP;      //Address offset: 0x94
//    __IO uint32_t I2C_GCR;        //Address offset: 0x98
  __IO uint16_t IC_CON;
  uint16_t  RESERVED0;
  __IO uint16_t IC_TAR;
  uint16_t  RESERVED1;
  __IO uint16_t IC_SAR;
  uint16_t  RESERVED2;
//  __IO uint16_t IC_HS_MADDR;
  uint16_t  RESERVED00;
  uint16_t  RESERVED3;
  __IO uint16_t IC_DATA_CMD;
  uint16_t  RESERVED4;
  __IO uint16_t IC_SS_SCL_HCNT;
  uint16_t  RESERVED5;
  __IO uint16_t IC_SS_SCL_LCNT;
  uint16_t  RESERVED6;
  __IO uint16_t IC_FS_SCL_HCNT;
  uint16_t  RESERVED7;
  __IO uint16_t IC_FS_SCL_LCNT;
  uint16_t  RESERVED8;
//  __IO uint16_t IC_HS_SCL_HCNT;
  uint16_t  RESERVED01;
  uint16_t  RESERVED9;
  //  __IO uint16_t IC_HS_SCL_LCNT;
  uint16_t  RESERVED02;
  uint16_t  RESERVED10;
  __IO uint16_t IC_INTR_STAT;
  uint16_t  RESERVED11;
  __IO uint16_t IC_INTR_MASK;
  uint16_t  RESERVED12;
  __IO uint16_t IC_RAW_INTR_STAT;
  uint16_t  RESERVED13;
  __IO uint16_t IC_RX_TL;
  uint16_t  RESERVED14;
  __IO uint16_t IC_TX_TL;
  uint16_t  RESERVED15;
  __IO uint16_t IC_CLR_INTR;
  uint16_t  RESERVED16;
  __IO uint16_t IC_CLR_RX_UNDER;
  uint16_t  RESERVED17;
  __IO uint16_t IC_CLR_RX_OVER;
  uint16_t  RESERVED18;
  __IO uint16_t IC_CLR_TX_OVER;
  uint16_t  RESERVED19;
  __IO uint16_t IC_CLR_RD_REQ;
  uint16_t  RESERVED20;
  __IO uint16_t IC_CLR_TX_ABRT;
  uint16_t  RESERVED21;
  __IO uint16_t IC_CLR_RX_DONE;
  uint16_t  RESERVED22;
  __IO uint16_t IC_CLR_ACTIVITY;
  uint16_t  RESERVED23;
  __IO uint16_t IC_CLR_STOP_DET;
  uint16_t  RESERVED24;
  __IO uint16_t IC_CLR_START_DET;
  uint16_t  RESERVED25;
  __IO uint16_t IC_CLR_GEN_CALL;
  uint16_t  RESERVED26;
  __IO uint16_t IC_ENABLE;
  uint16_t  RESERVED27;
  
  __IO uint32_t IC_STATUS;
  __IO uint32_t IC_TXFLR;
  __IO uint32_t IC_RXFLR;
  __IO uint32_t IC_SDA_HOLD;
  uint32_t  RESERVED03;
  uint32_t  RESERVED04;
  __IO uint32_t IC_DMA_CR;
  uint32_t  RESERVED05;
  uint32_t  RESERVED06;
  __IO uint32_t IC_SDA_SETUP;
  __IO uint32_t IC_ACK_GENERAL_CALL;
} I2C_TypeDef;

/**
 * @brief Independent WATCHDOG
 */

