yang377156216/MM32F032xxx/MM32F032xx/Device/HALL_LIB/Include/MM32F032xx.h
typedef struct {
    __IO uint32_t KR;      //Address offset: 0x00
    __IO uint32_t PR;      //Address offset: 0x04
    __IO uint32_t RLR;     //Address offset: 0x08
    __IO uint32_t SR;      //Address offset: 0x0C
    __IO uint32_t CTRL;    //Address offset: 0x10
    __IO uint32_t IGEN;    //Address offset: 0x14
} IWDG_TypeDef;

/**
 * @brief Power Control
 */

typedef struct {
    __IO uint32_t CR;      //Address offset: 0x00
    __IO uint32_t CSR;     //Address offset: 0x04
} PWR_TypeDef;

/**
 * @brief Reset and Clock Control
 */

typedef struct {
    __IO uint32_t CR;           //Address offset: 0x00
    __IO uint32_t CFGR;         //Address offset: 0x04
    __IO uint32_t CIR;          //Address offset: 0x08
    __IO uint32_t APB2RSTR;     //Address offset: 0x0C
    __IO uint32_t APB1RSTR;     //Address offset: 0x10
    __IO uint32_t AHBENR;       //Address offset: 0x14
    __IO uint32_t APB2ENR;      //Address offset: 0x18
    __IO uint32_t APB1ENR;      //Address offset: 0x1C
    __IO uint32_t BDCR;         //Address offset: 0x20
    __IO uint32_t CSR;          //Address offset: 0x24
    __IO uint32_t AHBRSTR;      //Address offset: 0x28
    __IO uint32_t RCC_CFGR2;    //Address offset: 0x2C
    __IO uint32_t RCC_RNG;      //Address offset: 0x30
    __IO uint32_t RESERVED1;    
    __IO uint32_t RESERVED2;    
    __IO uint32_t RESERVED3;    
    __IO uint32_t SYSCFG;       //Address offset: 0x40
    __IO uint32_t HSIDLY;       //Address offset: 0x44
    __IO uint32_t HSEDLY;       //Address offset: 0x48

} RCC_TypeDef;

/**
 * @brief RTC
 */

typedef struct {
    __IO uint32_t CRH;         //Address offset: 0x00
    __IO uint32_t CRL;         //Address offset: 0x04
    __IO uint32_t PRLH;        //Address offset: 0x08
    __IO uint32_t PRLL;        //Address offset: 0x0C
    __IO uint32_t DIVH;        //Address offset: 0x10
    __IO uint32_t DIVL;        //Address offset: 0x14
    __IO uint32_t CNTH;        //Address offset: 0x18
    __IO uint32_t CNTL;        //Address offset: 0x1C
    __IO uint32_t ALRH;        //Address offset: 0x20
    __IO uint32_t ALRL;        //Address offset: 0x24
    __IO uint32_t MSRH;        //Address offset: 0x28
    __IO uint32_t MSRL;        //Address offset: 0x2C
} RTC_TypeDef;

/**
 * @brief Serial Peripheral Interface
 */

typedef struct {
    __IO uint32_t TXREG;         //Address offset: 0x00
    __IO uint32_t RXREG;         //Address offset: 0x04
    __IO uint32_t CSTAT;         //Address offset: 0x08   
    __IO uint32_t INTSTAT;       //Address offset: 0x0C
    __IO uint32_t INTEN;         //Address offset: 0x10
    __IO uint32_t INTCLR;        //Address offset: 0x14
		__IO uint16_t GCTL;
		uint16_t  RESERVED2;
		__IO uint16_t CCTL;
		uint16_t  RESERVED3;
    __IO uint32_t SPBRG;         //Address offset: 0x20
    __IO uint32_t RXDNR;         //Address offset: 0x24
    __IO uint16_t NSSR;          //Address offset: 0x28
    uint16_t      RESERVED4;
    __IO uint32_t EXTCTL;        //Address offset: 0x2C
} SPI_TypeDef;

/**
 * @brief TIM
 */

typedef struct {
    __IO uint32_t CR1;           //Address offset: 0x00
    __IO uint32_t CR2;           //Address offset: 0x04
    __IO uint32_t SMCR;          //Address offset: 0x08   
    __IO uint32_t DIER;          //Address offset: 0x0C
    __IO uint32_t SR;            //Address offset: 0x10
    __IO uint32_t EGR;           //Address offset: 0x14
    __IO uint32_t CCMR1;         //Address offset: 0x18
    __IO uint32_t CCMR2;         //Address offset: 0x1C
    __IO uint32_t CCER;          //Address offset: 0x20
    __IO uint32_t CNT;           //Address offset: 0x24
    __IO uint32_t PSC;           //Address offset: 0x28
    __IO uint32_t ARR;           //Address offset: 0x2C
    __IO uint32_t RCR;           //Address offset: 0x30
    __IO uint32_t CCR1;          //Address offset: 0x34
    __IO uint32_t CCR2;          //Address offset: 0x38
    __IO uint32_t CCR3;          //Address offset: 0x3C
    __IO uint32_t CCR4;          //Address offset: 0x40
    __IO uint32_t BDTR;          //Address offset: 0x44
    __IO uint32_t DCR;           //Address offset: 0x48
    __IO uint32_t DMAR;          //Address offset: 0x4C
    uint32_t RESERVED0;            
    __IO uint32_t CCMR3;         //Address offset: 0x54 
    __IO uint32_t CCR5;          //Address offset: 0x58
    __IO uint32_t PDER;          //Address offset: 0x5C 
    __IO uint32_t CCR1FALL;      //Address offset: 0x60 
    __IO uint32_t CCR2FALL;      //Address offset: 0x64 
    __IO uint32_t CCR3FALL;      //Address offset: 0x68 
    __IO uint32_t CCR4FALL;      //Address offset: 0x6C 
    __IO uint32_t CCR5FALL;      //Address offset: 0x70 

} TIM_TypeDef;

/**
 * @brief Universal Synchronous Asynchronous Receiver Transmitter
 */

typedef struct {
    __IO uint32_t TDR;           //Address offset: 0x00
    __IO uint32_t RDR;           //Address offset: 0x04
    __IO uint32_t CSR;           //Address offset: 0x08 
    __IO uint32_t ISR;           //Address offset: 0x0C
    __IO uint32_t IER;           //Address offset: 0x10
    __IO uint32_t ICR;           //Address offset: 0x14
    __IO uint32_t GCR;           //Address offset: 0x18
    __IO uint32_t CCR;           //Address offset: 0x1C
    __IO uint32_t BRR;           //Address offset: 0x20
    __IO uint32_t FRA;           //Address offset: 0x24
    __IO uint32_t RXADD;         //Address offset: 0x28
    __IO uint32_t RXMASK;        //Address offset: 0x2C
    __IO uint32_t SCR;           //Address offset: 0x30
    __IO uint32_t IDLR;          //Address offset: 0x34
} UART_TypeDef;

/**
 * @brief Analog Comparators
 */
typedef struct {
    __IO uint32_t COMP1_CSR;           //Address offset: 0x00
    __IO uint32_t COMP2_CSR;           //Address offset: 0x04
    uint32_t RESERVED0;  
    uint32_t RESERVED1;  
    uint32_t RESERVED2;  
    uint32_t RESERVED3;    
    __IO uint32_t COMP_CRV;            //Address offset: 0x18
    __IO uint32_t COMP1_POLL;          //Address offset: 0x1C
    __IO uint32_t COMP2_POLL;          //Address offset: 0x20

