yang377156216/MM32F032xxx/MM32F032xx/Device/HALL_LIB/Include/MM32F032xx.h
#define SYSCFG         ((SYSCFG_TypeDef*)SYSCFG_BASE)
#define EXTI           ((EXTI_TypeDef*)EXTI_BASE)
#define ADC1           ((ADC_TypeDef*)ADC1_BASE)
#define TIM1           ((TIM_TypeDef*)TIM1_BASE)
#define SPI1           ((SPI_TypeDef*)SPI1_BASE)
#define DBGMCU         ((DBGMCU_TypeDef*)DBGMCU_BASE)
#define UART1          ((UART_TypeDef*)UART1_BASE)
#define COMP           ((COMP_TypeDef *) COMP_BASE)
#define COMP1          ((COMP_TypeDef *) COMP1_BASE)
#define COMP2          ((COMP_TypeDef *) COMP2_BASE)
#define TIM14          ((TIM_TypeDef*)TIM14_BASE)
#define TIM16          ((TIM_TypeDef*)TIM16_BASE)
#define TIM17          ((TIM_TypeDef*)TIM17_BASE)

#define DMA1           ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Channel1  ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE)
#define DMA1_Channel2  ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE)
#define DMA1_Channel3  ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE)
#define DMA1_Channel4  ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE)
#define DMA1_Channel5  ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE)
#define RCC            ((RCC_TypeDef *) RCC_BASE)
#define FLASH          ((FLASH_TypeDef *) FLASH_R_BASE)
#define CRC            ((CRC_TypeDef *)   CRC_BASE)
#define HWDIV          ((HWDIV_TypeDef *) HWDIV_BASE)
#define GPIOA          ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB          ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC          ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD          ((GPIO_TypeDef *) GPIOD_BASE)

/**
 * @}
 */
 
/** @addtogroup Peripheral_Registers_Bits_Definition
 * @{
 */

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for PWR_CR register  ********************/
#define PWR_CR_LPDS         ((uint16_t)0x0001) /*!< Low-Power Deepsleep */
#define PWR_CR_PDDS         ((uint16_t)0x0002) /*!< Power Down Deepsleep */
#define PWR_CR_CWUF         ((uint16_t)0x0004) /*!< Clear Wakeup Flag */
#define PWR_CR_CSBF         ((uint16_t)0x0008) /*!< Clear Standby Flag */
#define PWR_CR_PVDE         ((uint16_t)0x0010) /*!< Power Voltage Detector Enable */

#define PWR_CR_PLS          ((uint16_t)0x00E0)   /*!< PLS[2:0] bits (PVD Level Selection) */
#define PWR_CR_PLS_0        ((uint16_t)0x0020) /*!< Bit 0 */
#define PWR_CR_PLS_1        ((uint16_t)0x0040) /*!< Bit 1 */
#define PWR_CR_PLS_2        ((uint16_t)0x0080) /*!< Bit 2 */

/*!< PVD level configuration */
#define PWR_CR_PLS_1V8      ((uint16_t)0x00000) /*!< PVD level 1.8V */
#define PWR_CR_PLS_2V1      ((uint16_t)0x00200) /*!< PVD level 2.1V */
#define PWR_CR_PLS_2V4      ((uint16_t)0x00400) /*!< PVD level 2.4V */
#define PWR_CR_PLS_2V7      ((uint16_t)0x00600) /*!< PVD level 2.7V */
#define PWR_CR_PLS_3V0      ((uint16_t)0x00800) /*!< PVD level 3.0V */
#define PWR_CR_PLS_3V3      ((uint16_t)0x00A00) /*!< PVD level 3.3V */
#define PWR_CR_PLS_3V6      ((uint16_t)0x00C00) /*!< PVD level 3.6V */
#define PWR_CR_PLS_3V9      ((uint16_t)0x00E00) /*!< PVD level 3.9V */
#define PWR_CR_PLS_4V2      ((uint16_t)0x01000) /*!< PVD level 4.2V */
#define PWR_CR_PLS_4V5      ((uint16_t)0x01200) /*!< PVD level 4.5V */
#define PWR_CR_PLS_4V8      ((uint16_t)0x01400) /*!< PVD level 4.8V */

#define PWR_CR_DBP ((uint16_t)0x0100) /*!< Disable Backup Domain write protection */

/*******************  Bit definition for PWR_CSR register  ********************/
#define PWR_CSR_WUF         ((uint16_t)0x0001)  /*!< Wakeup Flag */
#define PWR_CSR_SBF         ((uint16_t)0x0002)  /*!< Standby Flag */
#define PWR_CSR_PVDO        ((uint16_t)0x0004) /*!< PVD Output */
#define PWR_CSR_EWUP        ((uint16_t)0x0100) /*!< Enable WKUP pin */

/******************************************************************************/
/*                                                                            */
/*                            Backup registers                                */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for BKP_DR1 register  ********************/
#define BKP_DR1_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR2 register  ********************/
#define BKP_DR2_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR3 register  ********************/
#define BKP_DR3_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR4 register  ********************/
#define BKP_DR4_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR5 register  ********************/
#define BKP_DR5_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR6 register  ********************/
#define BKP_DR6_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR7 register  ********************/
#define BKP_DR7_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR8 register  ********************/
#define BKP_DR8_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR9 register  ********************/
#define BKP_DR9_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR10 register  *******************/
#define BKP_DR10_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR10 register  *******************/
#define BKP_DR11_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR10 register  *******************/
#define BKP_DR12_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR10 register  *******************/
#define BKP_DR13_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR10 register  *******************/
#define BKP_DR14_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR10 register  *******************/
#define BKP_DR15_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR10 register  *******************/
#define BKP_DR16_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR10 register  *******************/
#define BKP_DR17_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR10 register  *******************/
#define BKP_DR18_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR10 register  *******************/
#define BKP_DR19_D           ((uint16_t)0xFFFF) /*!< Backup data */

/*******************  Bit definition for BKP_DR10 register  *******************/
#define BKP_DR20_D           ((uint16_t)0xFFFF) /*!< Backup data */

/******************  Bit definition for BKP_RTCCR register  *******************/
#define BKP_RTCCR_CAL        ((uint16_t)0x007F)  /*!< Calibration value */
#define BKP_RTCCR_CCO        ((uint16_t)0x0080)  /*!< Calibration Clock Output */
#define BKP_RTCCR_ASOE       ((uint16_t)0x0100) /*!< Alarm or Second Output Enable */
#define BKP_RTCCR_ASOS       ((uint16_t)0x0200) /*!< Alarm or Second Output Selection */

/********************  Bit definition for BKP_CR register  ********************/
#define BKP_CR_TPE           ((uint8_t)0x01)  /*!< TAMPER pin enable */
#define BKP_CR_TPAL          ((uint8_t)0x02) /*!< TAMPER pin active level */

/*******************  Bit definition for BKP_CSR register  ********************/
#define BKP_CSR_CTE          ((uint16_t)0x0001)  /*!< Clear Tamper event */
#define BKP_CSR_CTI          ((uint16_t)0x0002)  /*!< Clear Tamper Interrupt */
#define BKP_CSR_TPIE         ((uint16_t)0x0004) /*!< TAMPER Pin interrupt enable */
#define BKP_CSR_TEF          ((uint16_t)0x0100)  /*!< Tamper Event Flag */
#define BKP_CSR_TIF          ((uint16_t)0x0200)  /*!< Tamper Interrupt Flag */

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for RCC_CR register  ********************/
#define RCC_CR_HSION         ((uint32_t)0x00000001)   /*!< Internal High Speed clock enable */
#define RCC_CR_HSIRDY        ((uint32_t)0x00000002)  /*!< Internal High Speed clock ready flag */
#define RCC_CR_HSITRIM       ((uint32_t)0x000000F8) /*!< Internal High Speed clock trimming */
#define RCC_CR_HSICAL        ((uint32_t)0x0000FF00)  /*!< Internal High Speed clock Calibration */
#define RCC_CR_HSEON         ((uint32_t)0x00010000)   /*!< External High Speed clock enable */
#define RCC_CR_HSERDY        ((uint32_t)0x00020000)  /*!< External High Speed clock ready flag */
#define RCC_CR_HSEBYP        ((uint32_t)0x00040000)  /*!< External High Speed clock Bypass */
#define RCC_CR_CSSON         ((uint32_t)0x00080000)   /*!< Clock Security System enable */
#define RCC_CR_PLLON         ((uint32_t)0x01000000)   /*!< PLL enable */
#define RCC_CR_PLLRDY        ((uint32_t)0x02000000)  /*!< PLL clock ready flag */

#define RCC_CR_PLLDN        ((uint32_t)0xFC000000)   /*!< PLLDN[5:0] bits */
#define RCC_CR_PLLDN_0      ((uint32_t)0x04000000) /*!< Bit 0 */
#define RCC_CR_PLLDN_1      ((uint32_t)0x08000000) /*!< Bit 1 */
#define RCC_CR_PLLDN_2      ((uint32_t)0x10000000) /*!< Bit 2 */
#define RCC_CR_PLLDN_3      ((uint32_t)0x20000000) /*!< Bit 3 */
#define RCC_CR_PLLDN_4      ((uint32_t)0x40000000) /*!< Bit 4 */
#define RCC_CR_PLLDN_5      ((uint32_t)0x80000000) /*!< Bit 5 */

#define RCC_CR_PLLDM        ((uint32_t)0x00700000)   /*!< PLLDM[2:0] bits */
#define RCC_CR_PLLDM_0      ((uint32_t)0x00100000) /*!< Bit 0 */
#define RCC_CR_PLLDM_1      ((uint32_t)0x00200000) /*!< Bit 1 */
#define RCC_CR_PLLDM_2      (((uint32_t)0x00400000) /*!< Bit 2 */
/*******************  Bit definition for RCC_CFGR register  *******************/
#define RCC_CFGR_SW         ((uint32_t)0x00000003)   /*!< SW[1:0] bits (System clock Switch) */
#define RCC_CFGR_SW_0       ((uint32_t)0x00000001) /*!< Bit 0 */
#define RCC_CFGR_SW_1       (uint32_t)0x00000002) /*!< Bit 1 */

/*!< SW configuration */
#define RCC_CFGR_SW_HSI ((uint32_t)0x00000000) /*!< HSI selected as system clock */
#define RCC_CFGR_SW_HSE ((uint32_t)0x00000001) /*!< HSE selected as system clock */
#define RCC_CFGR_SW_PLL ((uint32_t)0x00000002) /*!< PLL selected as system clock */

#define RCC_CFGR_SWS ((uint32_t)0x0000000C)   /*!< SWS[1:0] bits (System Clock Switch Status) */
#define RCC_CFGR_SWS_0 ((uint32_t)0x00000004) /*!< Bit 0 */
#define RCC_CFGR_SWS_1 ((uint32_t)0x00000008) /*!< Bit 1 */

/*!< SWS configuration */
#define RCC_CFGR_SWS_HSI ((uint32_t)0x00000000) /*!< HSI oscillator used as system clock */
#define RCC_CFGR_SWS_HSE ((uint32_t)0x00000004) /*!< HSE oscillator used as system clock */
#define RCC_CFGR_SWS_PLL ((uint32_t)0x00000008) /*!< PLL used as system clock */

#define RCC_CFGR_HPRE ((uint32_t)0x000000F0)   /*!< HPRE[3:0] bits (AHB prescaler) */
#define RCC_CFGR_HPRE_0 ((uint32_t)0x00000010) /*!< Bit 0 */
#define RCC_CFGR_HPRE_1 ((uint32_t)0x00000020) /*!< Bit 1 */
#define RCC_CFGR_HPRE_2 ((uint32_t)0x00000040) /*!< Bit 2 */
#define RCC_CFGR_HPRE_3 ((uint32_t)0x00000080) /*!< Bit 3 */

