yang377156216/MM32F032xxx/MM32F032xx/Device/HALL_LIB/Include/MM32F032xx.h
/******************  Bit definition for DMA_CNDTR6 register  ******************/
#define DMA_CNDTR6_NDT ((uint16_t)0xFFFF) /*!<Number of data to Transfer */

/******************  Bit definition for DMA_CNDTR7 register  ******************/
#define DMA_CNDTR7_NDT ((uint16_t)0xFFFF) /*!<Number of data to Transfer */

/******************  Bit definition for DMA_CPAR1 register  *******************/
#define DMA_CPAR1_PA ((uint32_t)0xFFFFFFFF) /*!<Peripheral Address */

/******************  Bit definition for DMA_CPAR2 register  *******************/
#define DMA_CPAR2_PA ((uint32_t)0xFFFFFFFF) /*!<Peripheral Address */

/******************  Bit definition for DMA_CPAR3 register  *******************/
#define DMA_CPAR3_PA ((uint32_t)0xFFFFFFFF) /*!<Peripheral Address */

/******************  Bit definition for DMA_CPAR4 register  *******************/
#define DMA_CPAR4_PA ((uint32_t)0xFFFFFFFF) /*!<Peripheral Address */

/******************  Bit definition for DMA_CPAR5 register  *******************/
#define DMA_CPAR5_PA ((uint32_t)0xFFFFFFFF) /*!<Peripheral Address */

/******************  Bit definition for DMA_CPAR6 register  *******************/
#define DMA_CPAR6_PA ((uint32_t)0xFFFFFFFF) /*!<Peripheral Address */

/******************  Bit definition for DMA_CPAR7 register  *******************/
#define DMA_CPAR7_PA ((uint32_t)0xFFFFFFFF) /*!<Peripheral Address */

/******************  Bit definition for DMA_CMAR1 register  *******************/
#define DMA_CMAR1_MA ((uint32_t)0xFFFFFFFF) /*!<Memory Address */

/******************  Bit definition for DMA_CMAR2 register  *******************/
#define DMA_CMAR2_MA ((uint32_t)0xFFFFFFFF) /*!<Memory Address */

/******************  Bit definition for DMA_CMAR3 register  *******************/
#define DMA_CMAR3_MA ((uint32_t)0xFFFFFFFF) /*!<Memory Address */

/******************  Bit definition for DMA_CMAR4 register  *******************/
#define DMA_CMAR4_MA ((uint32_t)0xFFFFFFFF) /*!<Memory Address */

/******************  Bit definition for DMA_CMAR5 register  *******************/
#define DMA_CMAR5_MA ((uint32_t)0xFFFFFFFF) /*!<Memory Address */

/******************  Bit definition for DMA_CMAR6 register  *******************/
#define DMA_CMAR6_MA ((uint32_t)0xFFFFFFFF) /*!<Memory Address */

/******************  Bit definition for DMA_CMAR7 register  *******************/
#define DMA_CMAR7_MA ((uint32_t)0xFFFFFFFF) /*!<Memory Address */

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter                         */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for ADDATA register  ********************/
#define ADDATA_DATA ((uint32_t)0x00000FFF)         /*!<ADC 12bit convert data */
#define ADDATA_CHANNELSEL ((uint32_t)0x00070000)   /*!<CHANNELSEL[19:16] (ADC current channel convert data) */
#define ADDATA_CHANNELSEL_0 ((uint32_t)0x00010000) /*!<Bit 0 */
#define ADDATA_CHANNELSEL_1 ((uint32_t)0x00020000) /*!<Bit 1*/
#define ADDATA_CHANNELSEL_2 ((uint32_t)0x00040000) /*!<Bit 2 */
#define ADDATA_CHANNELSEL_3 ((uint32_t)0x00080000) /*!<Bit 3 */
#define ADDATA_OVERRUN ((uint32_t)0x00100000)      /*!<ADC data will be cover */
#define ADDATA_VALID ((uint32_t)0x00200000)        /*!<ADC data[11:0] is valid*/

/********************  Bit definition for ADCFG register  ********************/
#define ADCFG_ADEN ((uint32_t)0x00000001)      /*!<ADC convert enable */
#define ADCFG_ADWEN ((uint32_t)0x00000002)     /*!<ADC window compare enable */
#define ADCFG_TVSEN ((uint32_t)0x00000004)     /*!<ADC sensor enable */
#define ADCFG_ADCPRE_2 ((uint32_t)0x00000000)  /*!<ADC preclk 2 */
#define ADCFG_ADCPRE_4 ((uint32_t)0x00000010)  /*!<ADC preclk 4 */
#define ADCFG_ADCPRE_6 ((uint32_t)0x00000020)  /*!<ADC preclk 6 */
#define ADCFG_ADCPRE_8 ((uint32_t)0x00000030)  /*!<ADC preclk 8 */
#define ADCFG_ADCPRE_10 ((uint32_t)0x00000040) /*!<ADC preclk 10 */
#define ADCFG_ADCPRE_12 ((uint32_t)0x00000050) /*!<ADC preclk 12 */
#define ADCFG_ADCPRE_14 ((uint32_t)0x00000060) /*!<ADC preclk 14 */
#define ADCFG_ADCPRE_16 ((uint32_t)0x00000070) /*!<ADC preclk 16 */

/********************  Bit definition for ADCR register  ********************/
#define ADCR_ADIE ((uint32_t)0x00000001)     /*!<ADC interrupt enable */
#define ADCR_ADWIE ((uint32_t)0x00000002)    /*!<ADC window compare interrupt enable */
#define ADCR_TRGEN ((uint32_t)0x00000004)    /*!<extranal trigger single start AD convert */
#define ADCR_DMAEN ((uint32_t)0x00000008)    /*!<ADC DMA enable */
#define ADCR_TRGSEL ((uint32_t)0x00000070)   /*!<TRGSEL[6:4] ADC1 external trigger source select */
#define ADCR_TRGSEL_0 ((uint32_t)0x00000010) /*!<Bit 0 */
#define ADCR_TRGSEL_1 ((uint32_t)0x00000020) /*!<Bit 1 */
#define ADCR_TRGSEL_2 ((uint32_t)0x00000040) /*!<Bit 2 */

#define ADCR_ADST ((uint32_t)0x00000100)          /*!<ADC start convert data */
#define ADCR_ADMD_SINGLE ((uint32_t)0x00000000)   /*!<ADC single convert mode */
#define ADCR_ADMD_PERIOD ((uint32_t)0x00000200)   /*!<ADC single period convert mode */
#define ADCR_ADMD_CONTINUE ((uint32_t)0x00000400) /*!<ADC continue scan convert mode */
#define ADCR_ALIGN_LEFT ((uint32_t)0x00000800)    /*!<ADC data left align */
#define ADCR_ALIGN_RIGHT ((uint32_t)0x00000000)   /*!<ADC data right align */
#define ADCR_CMPCH ((uint32_t)0x0000F000)         /*!<CMPCH[15:12] ADC window compare channel0 convert data */
#define ADCR_CMPCH_0 ((uint32_t)0x00001000)       /*!<Bit 0 */
#define ADCR_CMPCH_1 ((uint32_t)0x00002000)       /*!<Bit 1 */
#define ADCR_CMPCH_2 ((uint32_t)0x00004000)       /*!<Bit 2 */
#define ADCR_CMPCH_3 ((uint32_t)0x00008000)       /*!<Bit 3 */

/********************  Bit definition for ADCHS register  ********************/
#define ADCHS_CHEN0 ((uint32_t)0x00000001)    /*!<ADC channel0 enable */
#define ADCHS_CHEN1 ((uint32_t)0x00000002)    /*!<ADC channel1 enable */
#define ADCHS_CHEN2 ((uint32_t)0x00000004)    /*!<ADC channel2 enable */
#define ADCHS_CHEN3 ((uint32_t)0x00000008)    /*!<ADC channel3 enable */
#define ADCHS_CHEN4 ((uint32_t)0x00000010)    /*!<ADC channel4 enable */
#define ADCHS_CHEN5 ((uint32_t)0x00000020)    /*!<ADC channel5 enable */
#define ADCHS_CHEN6 ((uint32_t)0x00000040)    /*!<ADC channel6 enable */
#define ADCHS_CHEN7 ((uint32_t)0x00000080)    /*!<ADC channel7 enable */
#define ADCHS_SENSOREN ((uint32_t)0x00000100) /*!<ADC sensor enable */

/********************  Bit definition for ADCMPR register  ********************/
#define ADCMPR_CMPLDATA ((uint32_t)0x00000FFF) /*!<ADC 12bit window compare DOWN LEVEL DATA*/
#define ADCMPR_CMPHDATA ((uint32_t)0x0FFF0000) /*!<ADC 12bit window compare UP LEVEL DATA*/

/********************  Bit definition for ADSTA register  ********************/
#define ADSTA_ADIF ((uint32_t)0x00000001)      /*!<ADC convert complete flag*/
#define ADSTA_ADWIF ((uint32_t)0x00000002)     /*!<ADC compare flag*/
#define ADSTA_BUSY ((uint32_t)0x00000004)      /*!<ADC busy flag*/
#define ADSTA_CHANNEL ((uint32_t)0x000001F0)   /*!<CHANNEL[8:4] ADC current channel*/
#define ADSTA_CHANNEL_0 ((uint32_t)0x00000010) /*!<Bit 0 */
#define ADSTA_CHANNEL_1 ((uint32_t)0x00000020) /*!<Bit 1*/
#define ADSTA_CHANNEL_2 ((uint32_t)0x00000040) /*!<Bit 2*/
#define ADSTA_CHANNEL_3 ((uint32_t)0x00000080) /*!<Bit 3*/
#define ADSTA_CHANNEL_4 ((uint32_t)0x00000100) /*!<Bit 4*/

#define ADSTA_VALID ((uint32_t)0x0001FE00)     /*!<VALID[16:9] ADC channel0 valid flag*/
#define ADSTA_VALID_0 ((uint32_t)0x00000200)   /*!<Bit 0*/
#define ADSTA_VALID_1 ((uint32_t)0x00000400)   /*!<Bit 1*/
#define ADSTA_VALID_2 ((uint32_t)0x00000800)   /*!<Bit 2*/
#define ADSTA_VALID_3 ((uint32_t)0x00001000)   /*!<Bit 3*/
#define ADSTA_VALID_4 ((uint32_t)0x00002000)   /*!<Bit 4*/
#define ADSTA_VALID_5 ((uint32_t)0x00004000)   /*!<Bit 5*/
#define ADSTA_VALID_6 ((uint32_t)0x00008000)   /*!<Bit 6*/
#define ADSTA_VALID_7 ((uint32_t)0x00010000)   /*!<Bit 7*/
#define ADSTA_OVERRUN ((uint32_t)0x1FF00000)   /*!<OVERRUN[28:20] ADC channel0 data covered flag*/
#define ADSTA_OVERRUN_0 ((uint32_t)0x00100000) /*!<Bit 0*/
#define ADSTA_OVERRUN_1 ((uint32_t)0x00200000) /*!<Bit 1*/
#define ADSTA_OVERRUN_2 ((uint32_t)0x00400000) /*!<Bit 2*/
#define ADSTA_OVERRUN_3 ((uint32_t)0x00800000) /*!<Bit 3*/
#define ADSTA_OVERRUN_4 ((uint32_t)0x01000000) /*!<Bit 4*/
#define ADSTA_OVERRUN_5 ((uint32_t)0x02000000) /*!<Bit 5*/
#define ADSTA_OVERRUN_6 ((uint32_t)0x04000000) /*!<Bit 6*/
#define ADSTA_OVERRUN_7 ((uint32_t)0x08000000) /*!<Bit 7*/
#define ADSTA_OVERRUN_8 ((uint32_t)0x10000000) /*!<Bit 8*/

/********************  Bit definition for ADDR0~ADDR8 register  ********************/
#define ADDR_DATA ((uint32_t)0x00000FFF)    /*!<ADC channel convert data */
#define ADDR_OVERRUN ((uint32_t)0x00100000) /*!<ADC data covered flag */
#define ADDR_VALID ((uint32_t)0x00200000)   /*!<ADC data valid flag*/

/******************************************************************************/
/*                                                                            */
/*                                   COMP                                     */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for COMP_CSR register  *******************/
#define COMP_CSR_EN ((uint32_t)0x00000001)
#define COMP_CSR_POL ((uint32_t)0x00008000)
#define COMP_CSR_OUT ((uint32_t)0x40000000)
#define COMP_CSR_LOCK ((uint32_t)0x80000000)

#define COMP_CSR_MODE ((uint32_t)0x0000000C)
#define COMP_CSR_MODE_0 ((uint32_t)0x00000004)
#define COMP_CSR_MODE_1 ((uint32_t)0x00000008)

