yang377156216/MM32F032xxx/MM32F032xx/Device/HALL_LIB/Include/MM32F032xx.h
/*******************  Bit definition for SPI_INTEN register  ********************/
#define SPI_INTEN_TX_IEN ((uint16_t)0x0001)
#define SPI_INTEN_RX_IEN ((uint16_t)0x0002)
#define SPI_INTEN_UNDERRUN_IEN ((uint16_t)0x0004)
#define SPI_INTEN_RXOERR_IEN ((uint16_t)0x0008)
#define SPI_INTEN_RXMATCH_IEN ((uint16_t)0x0010)
#define SPI_INTEN_RXFULL_IEN ((uint16_t)0x0020)
#define SPI_INTEN_TXEPT_IEN ((uint16_t)0x0040)

/*******************  Bit definition for SPI_INTCLR register  ********************/
#define SPI_INTCLR_TX_ICLR ((uint16_t)0x0001)
#define SPI_INTCLR_RX_ICLR ((uint16_t)0x0002)
#define SPI_INTCLR_UNDERRUN_ICLR ((uint16_t)0x0004)
#define SPI_INTCLR_RXOERR_ICLR ((uint16_t)0x0008)
#define SPI_INTCLR_RXMATCH_ICLR ((uint16_t)0x0010)
#define SPI_INTCLR_RXFULL_ICLR ((uint16_t)0x0020)
#define SPI_INTCLR_TXEPT_ICLR ((uint16_t)0x0040)

/*******************  Bit definition for SPI_GCTL register  ********************/
#define SPI_GCTL_SPIEN ((uint16_t)0x0001)
#define SPI_GCTL_INT_EN ((uint16_t)0x0002)
#define SPI_GCTL_MM ((uint16_t)0x0004)
#define SPI_GCTL_TXEN ((uint16_t)0x0008)
#define SPI_GCTL_RXEN ((uint16_t)0x0010)
#define SPI_GCTL_RXTLF ((uint16_t)0x0060)
#define SPI_GCTL_TXTLF ((uint16_t)0x0180)
#define SPI_GCTL_DMAEN ((uint16_t)0x0200)
#define SPI_GCTL_NSS_SEL ((uint16_t)0x0400)
#define SPI_GCTL_DATA_SEL ((uint16_t)0x0800)

/*******************  Bit definition for SPI_CCTL register  ********************/
#define SPI_CCTL_CPHA ((uint16_t)0x0001)
#define SPI_CCTL_CPOL ((uint16_t)0x0002)
#define SPI_CCTL_LSBFE ((uint16_t)0x0004)
#define SPI_CCTL_SPILEN ((uint16_t)0x0008)
#define SPI_CCTL_RXEDGE ((uint16_t)0x0010)
#define SPI_CCTL_TXEDGE ((uint16_t)0x0020)

/*******************  Bit definition for SPI_SPBRG register  ********************/
#define SPI_SPBRG_SPBRG ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SPI_RXDNR register  ********************/
#define SPI_RXDNR_RXDNR ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SPI_NSSR register  ********************/
#define SPI_NSSR_NSS ((uint8_t)0x01)

/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface                    */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for I2C_CON register  ********************/
#define I2C_CON_MASTER_MODE ((uint16_t)0x0001)
#define I2C_CON_10BITADDR_SLAVE ((uint16_t)0x0008)
#define I2C_CON_10BITADDR_MASTER ((uint16_t)0x0010)
#define I2C_CON_RESTART_EN ((uint16_t)0x0020)
#define I2C_CON_SLAVE_DISABLE ((uint16_t)0x0040)
#define I2C_CON_STOP_DET_IFADDRESSED ((uint16_t)0x0080)
#define I2C_CON_EMPTY_CTRL ((uint16_t)0x0100)

#define I2C_CON_SPEED ((uint16_t)0x0006)          
#define I2C_CON_SPEED_0 ((uint16_t)0x0002)
#define I2C_CON_SPEED_1 ((uint16_t)0x0004)

/*******************  Bit definition for I2C_TAR register  ********************/
#define I2C_TAR_GC_OR_START ((uint16_t)0x0400)
#define I2C_TAR_SPECIAL ((uint16_t)0x0800)

#define I2C_TAR_TAR ((uint16_t)0x03FF)
#define I2C_TAR_TAR_0 ((uint16_t)0x0001)
#define I2C_TAR_TAR_1 ((uint16_t)0x0002)
#define I2C_TAR_TAR_2 ((uint16_t)0x0004)
#define I2C_TAR_TAR_3 ((uint16_t)0x0008)
#define I2C_TAR_TAR_4 ((uint16_t)0x0010)
#define I2C_TAR_TAR_5 ((uint16_t)0x0020)
#define I2C_TAR_TAR_6 ((uint16_t)0x0040)
#define I2C_TAR_TAR_7 ((uint16_t)0x0080)
#define I2C_TAR_TAR_8 ((uint16_t)0x0100)
#define I2C_TAR_TAR_9 ((uint16_t)0x0200)

/*******************  Bit definition for I2C_SAR register  ********************/
#define I2C_SAR_SAR ((uint16_t)0x03FF)

/*******************  Bit definition for I2C_HS_MADDR register  ********************/
#define I2C_HS_MADDR ((uint16_t)0x0007)

/*******************  Bit definition for I2C_DATA_CMD register  ********************/
#define I2C_DATA_CMD_CMD ((uint16_t)0x0100)

#define I2C_DATA_CMD_DAT ((uint16_t)0x00FF)
#define I2C_DATA_CMD_DAT_0 ((uint16_t)0x0001)
#define I2C_DATA_CMD_DAT_1 ((uint16_t)0x0002)
#define I2C_DATA_CMD_DAT_2 ((uint16_t)0x0004)
#define I2C_DATA_CMD_DAT_3 ((uint16_t)0x0008)
#define I2C_DATA_CMD_DAT_4 ((uint16_t)0x0010)
#define I2C_DATA_CMD_DAT_5 ((uint16_t)0x0020)
#define I2C_DATA_CMD_DAT_6 ((uint16_t)0x0040)
#define I2C_DATA_CMD_DAT_7 ((uint16_t)0x0080)

/*******************  Bit definition for I2C_SS_SCL_HCNT register  ********************/
#define I2C_SS_SCL_HCNT ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_SS_SCL_LCNT register  ********************/
#define I2C_SS_SCL_LCNT ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_FS_SCL_HCNT register  ********************/
#define I2C_FS_SCL_HCNT ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_FS_SCL_LCNT register  ********************/
#define I2C_FS_SCL_LCNT ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_FS_SCL_HCNT register  ********************/
#define I2C_HS_SCL_HCNT ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_FS_SCL_LCNT register  ********************/
#define I2C_HS_SCL_LCNT ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_INTR_STAT register  ********************/
#define I2C_INTR_STAT_RX_UNDER ((uint16_t)0x0001)
#define I2C_INTR_STAT_RX_OVER ((uint16_t)0x0002)
#define I2C_INTR_STAT_RX_FULL ((uint16_t)0x0004)
#define I2C_INTR_STAT_TX_OVER ((uint16_t)0x0008)
#define I2C_INTR_STAT_TX_EMPTY ((uint16_t)0x0010)
#define I2C_INTR_STAT_RX_REQ ((uint16_t)0x0020)
#define I2C_INTR_STAT_TX_ABRT ((uint16_t)0x0040)
#define I2C_INTR_STAT_RX_DONE ((uint16_t)0x0080)
#define I2C_INTR_STAT_ACTIVITY ((uint16_t)0x0100)
#define I2C_INTR_STAT_STOP_DET ((uint16_t)0x0200)
#define I2C_INTR_STAT_START_DET ((uint16_t)0x0400)
#define I2C_INTR_STAT_GEN_CALL ((uint16_t)0x0800)
#define I2C_INTR_STAT_RESTART_DET ((uint16_t)0x1000)
#define I2C_INTR_STAT_MST_ON_HOLD ((uint16_t)0x2000)

/*******************  Bit definition for I2C_INTR_MASK register  ********************/
#define I2C_INTR_MASK_RX_UNDER ((uint16_t)0x0001)
#define I2C_INTR_MASK_RX_OVER ((uint16_t)0x0002)
#define I2C_INTR_MASK_RX_FULL ((uint16_t)0x0004)
#define I2C_INTR_MASK_TX_OVER ((uint16_t)0x0008)
#define I2C_INTR_MASK_TX_EMPTY ((uint16_t)0x0010)
#define I2C_INTR_MASK_RX_REQ ((uint16_t)0x0020)
#define I2C_INTR_MASK_TX_ABRT ((uint16_t)0x0040)
#define I2C_INTR_MASK_RX_DONE ((uint16_t)0x0080)
#define I2C_INTR_MASK_ACTIVITY ((uint16_t)0x0100)
#define I2C_INTR_MASK_STOP_DET ((uint16_t)0x0200)
#define I2C_INTR_MASK_START_DET ((uint16_t)0x0400)
#define I2C_INTR_MASK_GEN_CALL ((uint16_t)0x0800)
#define I2C_INTR_MASK_RESTART_DET ((uint16_t)0x1000)
#define I2C_INTR_MASK_MST_ON_HOLD ((uint16_t)0x2000)

/*******************  Bit definition for I2C_RAW_INTR_STAT register  ********************/
#define I2C_RAW_INTR_MASK_RX_UNDER ((uint16_t)0x0001)
#define I2C_RAW_INTR_MASK_RX_OVER ((uint16_t)0x0002)
#define I2C_RAW_INTR_MASK_RX_FULL ((uint16_t)0x0004)
#define I2C_RAW_INTR_MASK_TX_OVER ((uint16_t)0x0008)
#define I2C_RAW_INTR_MASK_TX_EMPTY ((uint16_t)0x0010)
#define I2C_RAW_INTR_MASK_RX_REQ ((uint16_t)0x0020)
#define I2C_RAW_INTR_MASK_TX_ABRT ((uint16_t)0x0040)
#define I2C_RAW_INTR_MASK_RX_DONE ((uint16_t)0x0080)
#define I2C_RAW_INTR_MASK_ACTIVITY ((uint16_t)0x0100)
#define I2C_RAW_INTR_MASK_STOP_DET ((uint16_t)0x0200)
#define I2C_RAW_INTR_MASK_START_DET ((uint16_t)0x0400)
#define I2C_RAW_INTR_MASK_GEN_CALL ((uint16_t)0x0800)
#define I2C_RAW_INTR_MASK_RESTART_DET ((uint16_t)0x1000)
#define I2C_RAW_INTR_MASK_MST_ON_HOLD ((uint16_t)0x2000)

/*******************  Bit definition for I2C_CLR_INTR register  ********************/
#define I2C_CLR_INTR ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_RX_UNDER register  ********************/
#define I2C_CLR_RX_UNDER ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_RX_OVER register  ********************/
#define I2C_CLR_RX_OVER ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_TX_OVER register  ********************/
#define I2C_CLR_TX_OVER ((uint16_t)0x0001)

