yang377156216/MM32F032xxx/MM32F032xx/Device/HALL_LIB/Include/MM32F032xx.h
/*******************  Bit definition for I2C_CLR_RD_REQ register  ********************/
#define I2C_CLR_RD_REQ ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_TX_ABRT register  ********************/
#define I2C_CLR_TX_ABRT ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_RX_DONE register  ********************/
#define I2C_CLR_RX_DONE ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_ACTIVITY register  ********************/
#define I2C_CLR_ACTIVITY ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_STOP_DET register  ********************/
#define I2C_CLR_STOP_DET ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_START_DET register  ********************/
#define I2C_CLR_START_DET ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_GEN_CALL register  ********************/
#define I2C_CLR_GEN_CALL ((uint16_t)0x0001)

/*******************  Bit definition for I2C_ENABLE register  ********************/
#define I2C_ENABLE_ENABLE ((uint16_t)0x0001)
#define I2C_ENABLE_ABORT ((uint16_t)0x0002)

/*******************  Bit definition for I2C_STATUS register  ********************/
#define I2C_STATUS_ACTIVITY ((uint16_t)0x0001)
#define I2C_STATUS_TFNF ((uint16_t)0x0002)
#define I2C_STATUS_TFE ((uint16_t)0x0004)
#define I2C_STATUS_RFNE ((uint16_t)0x0008)
#define I2C_STATUS_RFF ((uint16_t)0x0010)
#define I2C_STATUS_MST_ACTIVITY ((uint16_t)0x0020)
#define I2C_STATUS_SLV_ACTIVITY ((uint16_t)0x0040)

/*******************  Bit definition for I2C_TXFLR register  ********************/
#define I2C_TXFLR ((uint16_t)0x0003)
#define I2C_TXFLR_0 ((uint16_t)0x0001)
#define I2C_TXFLR_1 ((uint16_t)0x0002)

/*******************  Bit definition for I2C_RXFLR register  ********************/
#define I2C_RXFLR ((uint16_t)0x0003)
#define I2C_RXFLR_0 ((uint16_t)0x0001)
#define I2C_RXFLR_1 ((uint16_t)0x0002)

/*******************  Bit definition for I2C_SDA_HOLD register  ********************/
#define I2C_SDA_TX_HOLD ((uint32_t)0x0000FFFF)
#define I2C_SDA_RX_HOLD ((uint32_t)0xFFFF0000)

/*******************  Bit definition for I2C_DMA_CR register  ********************/
#define I2C_DMA_CR_RDMAE ((uint16_t)0x0001)
#define I2C_DMA_CR_TDMAE ((uint16_t)0x0002)

/*******************  Bit definition for I2C_SDA_SET_UP register  ********************/
#define I2C_SDA_SET_UP ((uint16_t)0x00FF)

/*******************  Bit definition for I2C_ACK_GENERAL_CALL register  ********************/
#define I2C_ACK_GENERAL_CALL ((uint16_t)0x0001)

/******************************************************************************/
/*                                                                            */
/*         Universal Synchronous Asynchronous Receiver Transmitter            */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for UART_TDR register  *******************/
#define UART_TDR_TXREG ((uint16_t)0x00FF)

/*******************  Bit definition for UART_RDR register  *******************/
#define UART_TDR_RXREG ((uint16_t)0x00FF)

/*******************  Bit definition for UART_CSR register  *******************/
#define UART_CSR_TXC ((uint16_t)0x0001)
#define UART_CSR_RXAVL ((uint16_t)0x0002)
#define UART_CSR_TXFULL ((uint16_t)0x0004)
#define UART_CSR_TXBUF_EMPTY ((uint16_t)0x0008)

/*******************  Bit definition for UART_ISR register  *******************/
#define UART_ISR_TX_INTF ((uint16_t)0x0001)
#define UART_ISR_RX_INTF ((uint16_t)0x0002)
#define UART_ISR_RXOERR_INTF ((uint16_t)0x0008)
#define UART_ISR_RXFERR_INTF ((uint16_t)0x0010)
#define UART_ISR_RXPERR_INTF ((uint16_t)0x0020)
#define UART_ISR_RXBRK_INFT ((uint16_t)0x0040)

/*******************  Bit definition for UART_IER register  *******************/
#define UART_IER_TXIEN ((uint16_t)0x0001)
#define UART_IER_RXIEN ((uint16_t)0x0002)
#define UART_IER_TIMEOUTEN ((uint16_t)0x0004)
#define UART_IER_RXOERREN ((uint16_t)0x0008)
#define UART_IER_RXPERREN ((uint16_t)0x0010)
#define UART_IER_RXFERREN ((uint16_t)0x0020)
#define UART_IER_RXBRKEN ((uint16_t)0x0040)

/*******************  Bit definition for UART_ICR register  *******************/
#define UART_ICR_TXICLR ((uint16_t)0x0001)
#define UART_ICR_RXICLR ((uint16_t)0x0002)
#define UART_ICR_TIMEOUTCLR ((uint16_t)0x0004)
#define UART_ICR_RXOERRCLR ((uint16_t)0x0008)
#define UART_ICR_RXPERRCLR ((uint16_t)0x0010)
#define UART_ICR_RXFERRCLR ((uint16_t)0x0020)
#define UART_ICR_RXBRKCLR ((uint16_t)0x0040)

/*******************  Bit definition for UART_GCR register  *******************/
#define UART_GCR_UARTEN ((uint16_t)0x0001)
#define UART_GCR_DMAMODE ((uint16_t)0x0002)
#define UART_GCR_AUTOFLOWEN ((uint16_t)0x0004)
#define UART_GCR_RXEN ((uint16_t)0x0008)
#define UART_GCR_TXEN ((uint16_t)0x0010)

/*******************  Bit definition for UART_CCR register  *******************/
#define UART_CCR_PEN ((uint16_t)0x0001)
#define UART_CCR_PSEL ((uint16_t)0x0002)
#define UART_CCR_SPB ((uint16_t)0x0004)
#define UART_CCR_BRK ((uint16_t)0x0008)

#define UART_CCR_CHAR ((uint16_t)0x0030)
#define UART_CCR_CHAR_0 ((uint16_t)0x0010)
#define UART_CCR_CHAR_1 ((uint16_t)0x0020)

/*******************  Bit definition for UART_BRR register  *******************/
#define UART_BRR_SPBRG ((uint16_t)0xFFFF)

/******************************************************************************/
/*                                                                            */
/*                                 Debug MCU                                  */
/*                                                                            */
/******************************************************************************/

/****************  Bit definition for DBGMCU_IDCODE register  *****************/
#define DBGMCU_IDCODE_DEV_ID ((uint32_t)0x00000FFF) /*!<Device Identifier */

#define DBGMCU_IDCODE_REV_ID ((uint32_t)0xFFFF0000)    /*!<REV_ID[15:0] bits (Revision Identifier) */
#define DBGMCU_IDCODE_REV_ID_0 ((uint32_t)0x00010000)  /*!<Bit 0 */
#define DBGMCU_IDCODE_REV_ID_1 ((uint32_t)0x00020000)  /*!<Bit 1 */
#define DBGMCU_IDCODE_REV_ID_2 ((uint32_t)0x00040000)  /*!<Bit 2 */
#define DBGMCU_IDCODE_REV_ID_3 ((uint32_t)0x00080000)  /*!<Bit 3 */
#define DBGMCU_IDCODE_REV_ID_4 ((uint32_t)0x00100000)  /*!<Bit 4 */
#define DBGMCU_IDCODE_REV_ID_5 ((uint32_t)0x00200000)  /*!<Bit 5 */
#define DBGMCU_IDCODE_REV_ID_6 ((uint32_t)0x00400000)  /*!<Bit 6 */
#define DBGMCU_IDCODE_REV_ID_7 ((uint32_t)0x00800000)  /*!<Bit 7 */
#define DBGMCU_IDCODE_REV_ID_8 ((uint32_t)0x01000000)  /*!<Bit 8 */
#define DBGMCU_IDCODE_REV_ID_9 ((uint32_t)0x02000000)  /*!<Bit 9 */
#define DBGMCU_IDCODE_REV_ID_10 ((uint32_t)0x04000000) /*!<Bit 10 */
#define DBGMCU_IDCODE_REV_ID_11 ((uint32_t)0x08000000) /*!<Bit 11 */
#define DBGMCU_IDCODE_REV_ID_12 ((uint32_t)0x10000000) /*!<Bit 12 */
#define DBGMCU_IDCODE_REV_ID_13 ((uint32_t)0x20000000) /*!<Bit 13 */
#define DBGMCU_IDCODE_REV_ID_14 ((uint32_t)0x40000000) /*!<Bit 14 */
#define DBGMCU_IDCODE_REV_ID_15 ((uint32_t)0x80000000) /*!<Bit 15 */

