yang377156216/MM32F032xxx/MM32F032xx/Device/HALL_LIB/Include/MM32F032xx.h
/******************  Bit definition for DBGMCU_CR register  *******************/
#define DBGMCU_CR_DBG_SLEEP ((uint32_t)0x00000001)   /*!<Debug Sleep Mode */
#define DBGMCU_CR_DBG_STOP ((uint32_t)0x00000002)    /*!<Debug Stop Mode */
#define DBGMCU_CR_DBG_STANDBY ((uint32_t)0x00000004) /*!<Debug Standby mode */
#define DBGMCU_CR_TRACE_IOEN ((uint32_t)0x00000020)  /*!<Trace Pin Assignment Control */

#define DBGMCU_CR_TRACE_MODE ((uint32_t)0x000000C0)   /*!<TRACE_MODE[1:0] bits (Trace Pin Assignment Control) */
#define DBGMCU_CR_TRACE_MODE_0 ((uint32_t)0x00000040) /*!<Bit 0 */
#define DBGMCU_CR_TRACE_MODE_1 ((uint32_t)0x00000080) /*!<Bit 1 */

#define DBGMCU_CR_DBG_IWDG_STOP ((uint32_t)0x00000100)          /*!<Debug Independent Watchdog stopped when Core is halted */
#define DBGMCU_CR_DBG_WWDG_STOP ((uint32_t)0x00000200)          /*!<Debug Window Watchdog stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM1_STOP ((uint32_t)0x00000400)          /*!<TIM1 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM2_STOP ((uint32_t)0x00000800)          /*!<TIM2 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM3_STOP ((uint32_t)0x00001000)          /*!<TIM3 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM4_STOP ((uint32_t)0x00002000)          /*!<TIM4 counter stopped when core is halted */
#define DBGMCU_CR_DBG_CAN_STOP ((uint32_t)0x00004000)           /*!<Debug CAN stopped when Core is halted */
#define DBGMCU_CR_DBG_I2C1_SMBUS_TIMEOUT ((uint32_t)0x00008000) /*!<SMBUS timeout mode stopped when Core is halted */
#define DBGMCU_CR_DBG_I2C2_SMBUS_TIMEOUT ((uint32_t)0x00010000) /*!<SMBUS timeout mode stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM5_STOP ((uint32_t)0x00020000)          /*!<TIM5 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM6_STOP ((uint32_t)0x00040000)          /*!<TIM6 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM7_STOP ((uint32_t)0x00080000)          /*!<TIM7 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM8_STOP ((uint32_t)0x00100000)          /*!<TIM8 counter stopped when core is halted */

/******************************************************************************/
/*                                                                            */
/*                      FLASH and Option Bytes Registers                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_ACR register  ******************/
#define FLASH_ACR_LATENCY ((uint8_t)0x03)   /*!<LATENCY[2:0] bits (Latency) */
#define FLASH_ACR_LATENCY_0 ((uint8_t)0x00) /*!<Bit 0 */
#define FLASH_ACR_LATENCY_1 ((uint8_t)0x01) /*!<Bit 0 */
#define FLASH_ACR_LATENCY_2 ((uint8_t)0x02) /*!<Bit 1 */

#define FLASH_ACR_HLFCYA ((uint8_t)0x08) /*!<Flash Half Cycle Access Enable */
#define FLASH_ACR_PRFTBE ((uint8_t)0x10) /*!<Prefetch Buffer Enable */
#define FLASH_ACR_PRFTBS ((uint8_t)0x20) /*!<Prefetch Buffer Status */

/******************  Bit definition for FLASH_KEYR register  ******************/
#define FLASH_KEYR_FKEYR ((uint32_t)0xFFFFFFFF) /*!<FPEC Key */

/*****************  Bit definition for FLASH_OPTKEYR register  ****************/
#define FLASH_OPTKEYR_OPTKEYR ((uint32_t)0xFFFFFFFF) /*!<Option Byte Key */

/******************  Bit definition for FLASH_SR register  *******************/
#define FLASH_SR_BSY ((uint8_t)0x01)      /*!<Busy */
#define FLASH_SR_PGERR ((uint8_t)0x04)    /*!<Programming Error */
#define FLASH_SR_WRPRTERR ((uint8_t)0x10) /*!<Write Protection Error */
#define FLASH_SR_EOP ((uint8_t)0x20)      /*!<End of operation */

/*******************  Bit definition for FLASH_CR register  *******************/
#define FLASH_CR_PG ((uint16_t)0x0001)     /*!<Programming */
#define FLASH_CR_PER ((uint16_t)0x0002)    /*!<Page Erase */
#define FLASH_CR_MER ((uint16_t)0x0004)    /*!<Mass Erase */
#define FLASH_CR_OPTPG ((uint16_t)0x0010)  /*!<Option Byte Programming */
#define FLASH_CR_OPTER ((uint16_t)0x0020)  /*!<Option Byte Erase */
#define FLASH_CR_STRT ((uint16_t)0x0040)   /*!<Start */
#define FLASH_CR_LOCK ((uint16_t)0x0080)   /*!<Lock */
#define FLASH_CR_OPTWRE ((uint16_t)0x0200) /*!<Option Bytes Write Enable */
#define FLASH_CR_ERRIE ((uint16_t)0x0400)  /*!<Error Interrupt Enable */
#define FLASH_CR_EOPIE ((uint16_t)0x1000)  /*!<End of operation interrupt enable */

/*******************  Bit definition for FLASH_AR register  *******************/
#define FLASH_AR_FAR ((uint32_t)0xFFFFFFFF) /*!<Flash Address */

/******************  Bit definition for FLASH_OBR register  *******************/
#define FLASH_OBR_OPTERR ((uint16_t)0x0001) /*!<Option Byte Error */
#define FLASH_OBR_RDPRT ((uint16_t)0x0002)  /*!<Read protection */

#define FLASH_OBR_USER ((uint16_t)0x03FC)       /*!<User Option Bytes */
#define FLASH_OBR_WDG_SW ((uint16_t)0x0004)     /*!<WDG_SW */
#define FLASH_OBR_nRST_STOP ((uint16_t)0x0008)  /*!<nRST_STOP */
#define FLASH_OBR_nRST_STDBY ((uint16_t)0x0010) /*!<nRST_STDBY */
#define FLASH_OBR_Notused ((uint16_t)0x03E0)    /*!<Not used */

/******************  Bit definition for FLASH_WRPR register  ******************/
#define FLASH_WRPR_WRP ((uint32_t)0xFFFFFFFF) /*!<Write Protect */

/*----------------------------------------------------------------------------*/

/******************  Bit definition for FLASH_RDP register  *******************/
#define FLASH_RDP_RDP ((uint32_t)0x000000FF)  /*!<Read protection option byte */
#define FLASH_RDP_nRDP ((uint32_t)0x0000FF00) /*!<Read protection complemented option byte */

/******************  Bit definition for FLASH_USER register  ******************/
#define FLASH_USER_USER ((uint32_t)0x00FF0000)  /*!<User option byte */
#define FLASH_USER_nUSER ((uint32_t)0xFF000000) /*!<User complemented option byte */

/******************  Bit definition for FLASH_Data0 register  *****************/
#define FLASH_Data0_Data0 ((uint32_t)0x000000FF)  /*!<User data storage option byte */
#define FLASH_Data0_nData0 ((uint32_t)0x0000FF00) /*!<User data storage complemented option byte */

/******************  Bit definition for FLASH_Data1 register  *****************/
#define FLASH_Data1_Data1 ((uint32_t)0x00FF0000)  /*!<User data storage option byte */
#define FLASH_Data1_nData1 ((uint32_t)0xFF000000) /*!<User data storage complemented option byte */

