yang377156216/MM32F032xxx/MM32F032xx/Device/HALL_LIB/Include/MM32F032xx.h
/*******************  Bit definition for USB_POWER register  *******************/
#define USB_POWER_SUSPEN ((uint16_t)0x0001)
#define USB_POWER_SUSP ((uint16_t)0x0002)
#define USB_POWER_WKUP ((uint16_t)0x0008)
/*----------------------------------------------------------------------------*/

/******************************************************************************/
/*                                                                            */
/*                                   CAN Registers and bits                   */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CAN_CMR register  *******************/
#define CAN_CMR_TR ((uint16_t)0x0001)
#define CAN_CMR_AT ((uint16_t)0x0002)
#define CAN_CMR_RRB ((uint16_t)0x0004)
#define CAN_CMR_CDO ((uint16_t)0x0008)
#define CAN_CMR_GTS ((uint16_t)0x0010)

/*******************  Bit definition for CAN_SR register  *******************/
#define CAN_SR_RBS ((uint16_t)0x0001)
#define CAN_SR_DOS ((uint16_t)0x0002)
#define CAN_SR_TBS ((uint16_t)0x0004)
#define CAN_SR_TCS ((uint16_t)0x0008)
#define CAN_SR_RS ((uint16_t)0x0010)
#define CAN_SR_TS ((uint16_t)0x0020)
#define CAN_SR_ES ((uint16_t)0x0040)
#define CAN_SR_BS ((uint16_t)0x0080)

/*******************  Bit definition for CAN_IR register  *******************/
#define CAN_IR_RI ((uint16_t)0x0001)
#define CAN_IR_TI ((uint16_t)0x0002)
#define CAN_IR_EI ((uint16_t)0x0004)
#define CAN_IR_DOI ((uint16_t)0x0008)
#define CAN_IR_WUI ((uint16_t)0x0010)
#define CAN_IR_EPI ((uint16_t)0x0020) /*PeliCAN*/
#define CAN_IR_ALI ((uint16_t)0x0040) /*PeliCAN*/
#define CAN_IR_BEI ((uint16_t)0x0080) /*PeliCAN*/

/*******************  Bit definition for CAN_BTR0 register  *******************/
#define CAN_BTR0_BRP ((uint16_t)0x003F)
#define CAN_BTR0_BRP_0 ((uint16_t)0x0001)
#define CAN_BTR0_BRP_1 ((uint16_t)0x0002)
#define CAN_BTR0_BRP_2 ((uint16_t)0x0004)
#define CAN_BTR0_BRP_3 ((uint16_t)0x0008)
#define CAN_BTR0_BRP_4 ((uint16_t)0x0010)
#define CAN_BTR0_BRP_5 ((uint16_t)0x0020)

#define CAN_BTR0_SJW ((uint16_t)0x00C0)
#define CAN_BTR0_SJW_0 ((uint16_t)0x0040)
#define CAN_BTR0_SJW_1 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_BTR1 register  *******************/
#define CAN_BTR1_SAM ((uint16_t)0x0080)

#define CAN_BTR1_TSEG1 ((uint16_t)0x000F)
#define CAN_BTR1_TSEG1_0 ((uint16_t)0x0001)
#define CAN_BTR1_TSEG1_1 ((uint16_t)0x0002)
#define CAN_BTR1_TSEG1_2 ((uint16_t)0x0004)
#define CAN_BTR1_TSEG1_3 ((uint16_t)0x0008)

#define CAN_BTR1_TSEG2 ((uint16_t)0x0070)
#define CAN_BTR1_TSEG2_0 ((uint16_t)0x0010)
#define CAN_BTR1_TSEG2_1 ((uint16_t)0x0020)
#define CAN_BTR1_TSEG2_2 ((uint16_t)0x0040)

/*******************  Bit definition for CAN_CDR register  *******************/
#define CAN_CDR_MODE ((uint16_t)0x0080)

/*!<BasicCAN registers */
/*******************  Bit definition for CAN_CR register  *******************/
#define CAN_CR_RR ((uint16_t)0x0001)
#define CAN_CR_RIE ((uint16_t)0x0002)
#define CAN_CR_TIE ((uint16_t)0x0004)
#define CAN_CR_EIE ((uint16_t)0x0008)
#define CAN_CR_OIE ((uint16_t)0x0010)

/*******************  Bit definition for CAN_ACR register  *******************/
#define CAN_ACR_AC ((uint16_t)0x00FF)
#define CAN_ACR_AC_0 ((uint16_t)0x0001)
#define CAN_ACR_AC_1 ((uint16_t)0x0002)
#define CAN_ACR_AC_2 ((uint16_t)0x0004)
#define CAN_ACR_AC_3 ((uint16_t)0x0008)
#define CAN_ACR_AC_4 ((uint16_t)0x0010)
#define CAN_ACR_AC_5 ((uint16_t)0x0020)
#define CAN_ACR_AC_6 ((uint16_t)0x0040)
#define CAN_ACR_AC_7 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_AMR register  *******************/
#define CAN_AMR_AM ((uint16_t)0x00FF)
#define CAN_AMR_AM_0 ((uint16_t)0x0001)
#define CAN_AMR_AM_1 ((uint16_t)0x0002)
#define CAN_AMR_AM_2 ((uint16_t)0x0004)
#define CAN_AMR_AM_3 ((uint16_t)0x0008)
#define CAN_AMR_AM_4 ((uint16_t)0x0010)
#define CAN_AMR_AM_5 ((uint16_t)0x0020)
#define CAN_AMR_AM_6 ((uint16_t)0x0040)
#define CAN_AMR_AM_7 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_TXID1 register  *******************/
#define CAN_TXID1_ID ((uint16_t)0x00FF)
#define CAN_TXID1_ID_3 ((uint16_t)0x0001)
#define CAN_TXID1_ID_4 ((uint16_t)0x0002)
#define CAN_TXID1_ID_5 ((uint16_t)0x0004)
#define CAN_TXID1_ID_6 ((uint16_t)0x0008)
#define CAN_TXID1_ID_7 ((uint16_t)0x0010)
#define CAN_TXID1_ID_8 ((uint16_t)0x0020)
#define CAN_TXID1_ID_9 ((uint16_t)0x0040)
#define CAN_TXID1_ID_10 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_TXID2 register  *******************/
#define CAN_TXID2_RTR ((uint16_t)0x0010)

#define CAN_TXID2_DLC ((uint16_t)0x000F)
#define CAN_TXID2_DLC_0 ((uint16_t)0x0001)
#define CAN_TXID2_DLC_1 ((uint16_t)0x0002)
#define CAN_TXID2_DLC_2 ((uint16_t)0x0004)
#define CAN_TXID2_DLC_3 ((uint16_t)0x0008)

#define CAN_TXID2_ID ((uint16_t)0x00E0)
#define CAN_TXID2_ID_0 ((uint16_t)0x0020)
#define CAN_TXID2_ID_1 ((uint16_t)0x0040)
#define CAN_TXID2_ID_2 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_TXDR0 register  *******************/
#define CAN_TXDR0 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR1 register  *******************/
#define CAN_TXDR1 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR2 register  *******************/
#define CAN_TXDR2 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR3 register  *******************/
#define CAN_TXDR3 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR4 register  *******************/
#define CAN_TXDR4 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR5 register  *******************/
#define CAN_TXDR5 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR6 register  *******************/
#define CAN_TXDR6 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_TXDR7 register  *******************/
#define CAN_TXDR7 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_RXID1 register  *******************/
#define CAN_RXID1_ID ((uint16_t)0x00FF)
#define CAN_RXID1_ID_3 ((uint16_t)0x0001)
#define CAN_RXID1_ID_4 ((uint16_t)0x0002)
#define CAN_RXID1_ID_5 ((uint16_t)0x0004)
#define CAN_RXID1_ID_6 ((uint16_t)0x0008)
#define CAN_RXID1_ID_7 ((uint16_t)0x0010)
#define CAN_RXID1_ID_8 ((uint16_t)0x0020)
#define CAN_RXID1_ID_9 ((uint16_t)0x0040)
#define CAN_RXID1_ID_10 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_RXID2 register  *******************/
#define CAN_RXID2_RTR ((uint16_t)0x0010)

